back-end/loadtest.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 100

scenarios:
  - name: "Get all patients"
    weight: 1
    flow:
      - get:
          url: "/api/patients"

  - name: "Create a new patient"
    weight: 10
    flow:
      - post:
          url: "/api/patients"
          json:
            Name: "John Doe"
            Age: 30
            Email: "johndoe@example.com"
            Phone_Number: 1234567890
            Address: "123 Main St"
            Emergency_Contact: "Jane Doe"